Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: 2. The method according to claim 1, wherein the obtaining small data transmission SDT failure information specifically comprises:
de_de: 2. Verfahren nach Anspruch 1, wobei das Erlangen von Fehlerinformationen über eine Übertragung kleiner Datenmengen (SDT) insbesondere Folgendes umfasst:

source: receiving a second request message from the terminal device, wherein the second request message is used to request to resume a radio resource control, RRC, connection; and
de_de: Empfangen einer zweiten Anforderungsnachricht von dem Endgerät, wobei die zweite Anforderungsnachricht verwendet wird, um anzufordern, dass eine Radio-Resource-Control-(RRC-)Verbindung fortgesetzt wird; und

source: starting SDT failure monitoring based on the second request message, and obtaining the SDT failure information.
de_de: Starten einer SDT-Fehlerüberwachung basierend auf der zweiten Anforderungsnachricht und Erlangen der SDT-Fehlerinformationen.

source: 3. The method according to claim 1, wherein the obtaining small data transmission SDT failure information specifically comprises:
de_de: 3. Verfahren nach Anspruch 1, wobei das Erlangen von Fehlerinformationen über eine Übertragung kleiner Datenmengen (SDT) insbesondere Folgendes umfasst:

source: receiving the SDT failure information from a second access network device.
de_de: Empfangen der SDT-Fehlerinformationen von einer zweiten Zugriffsnetzwerkvorrichtung.

source: 4. The method according to any one of claims 1 to 3, wherein the first access network device comprises a distributed unit and a central unit, and the AS context comprises a first AS context and a second AS context; and
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei die erste Zugriffsnetzwerkvorrichtung eine verteilte Einheit und eine Zentraleinheit umfasst und der AS-Kontext einen ersten AS-Kontext und einen zweiten AS-Kontext umfasst; und

source: the releasing an access stratum AS context of a terminal device based on the SDT failure information specifically comprises:
de_de: das Freigeben eines Access-Stratum-(AS-)Kontexts eines Endgeräts basierend auf den SDT-Fehlerinformationen insbesondere Folgendes umfasst:

source: releasing the first AS context of the terminal device based on the SDT failure information by using the distributed unit; and
de_de: Freigeben des ersten AS-Kontexts des Endgeräts basierend auf den SDT-Fehlerinformationen unter Verwendung der verteilten Einheit; und

source: sending a third request message to the central unit by using the distributed unit, wherein the third request message comprises the SDT failure information, and the third request message is used to request the central unit to release the second AS context of the terminal device.
de_de: Senden einer dritten Anforderungsnachricht an die Zentraleinheit unter Verwendung der verteilten Einheit, wobei die dritte Anforderungsnachricht die SDT-Fehlerinformationen umfasst, und die dritte Anforderungsnachricht verwendet wird, um die Zentraleinheit aufzufordern, den zweiten AS-Kontext des Endgeräts freizugeben.

source: 5. The method according to any one of claims 1 to 3, wherein the first access network device comprises a distributed unit and a central unit, and the AS context comprises a first AS context and a second AS context; and
de_de: 5. Verfahren nach einem der Ansprüche 1 bis 3, wobei die erste Zugriffsnetzwerkvorrichtung eine verteilte Einheit und eine Zentraleinheit umfasst und der AS-Kontext einen ersten AS-Kontext und einen zweiten AS-Kontext umfasst; und

source: releasing the second AS context of the terminal device based on the SDT failure information by using the central unit; and
de_de: Freigeben des zweiten AS-Kontexts des Endgeräts basierend auf den SDT-Fehlerinformationen unter Verwendung der Zentraleinheit; und

source: sending a fourth request message to the distributed unit by using the central unit, wherein the fourth request message comprises the SDT failure information, and the fourth request message is used to request the distributed unit to release the first AS context of the terminal device.
de_de: Senden einer vierten Anforderungsnachricht an die verteilte Einheit unter Verwendung der Zentraleinheit, wobei die vierte Anforderungsnachricht die SDT-Fehlerinformationen umfasst, und die vierte Anforderungsnachricht verwendet wird, um die verteilte Einheit aufzufordern, den ersten AS-Kontext des Endgeräts freizugeben.

source: 6. The method according to claim 4 or 5, wherein the sending a first request message to a core network device specifically comprises:
de_de: 6. Verfahren nach Anspruch 4 oder 5, wobei das Senden einer ersten Anforderungsnachricht an eine Kernnetzwerkvorrichtung insbesondere Folgendes umfasst:

source: sending the first request message to the core network device by using the central unit.
de_de: Senden der ersten Anforderungsnachricht an die Kernnetzwerkvorrichtung unter Verwendung der Zentraleinheit.

source: 7. The method according to any one of claims 1 to 6, wherein the SDT failure information comprises one or more of the following:
de_de: 7. Verfahren nach einem der Ansprüche 1 bis 6, wobei die SDT-Fehlerinformationen eines oder mehrere der folgenden Elemente umfassen:

source: duration of an SDT process is greater than or equal to a first SDT duration threshold; or
de_de: eine Dauer eines SDT-Prozesses, die größer oder gleich einem ersten SDT-Dauerschwellenwert ist; oder

source: a quantity of radio link control, RLC, retransmissions of SDT data reaches a first threshold for the quantity of RLC retransmissions of the SDT data.
de_de: eine Menge von Radio-Link-Control-(RLC-)Wiederholungsübertragungen von SDT-Daten, die einen ersten Schwellenwert für die Menge von RLC-Wiederholungsübertragungen der SDT-Daten erreicht.

source: 8. The method according to any one of claims 1 to 7, wherein the method further comprises:
de_de: 8. Verfahren nach einem der Ansprüche 1 bis 7, wobei das Verfahren ferner Folgendes umfasst:

source: receiving an acknowledgment message from the core network device, wherein the acknowledgment message indicates that the core network device has completed release of a NAS context of the terminal device.
de_de: Empfangen einer Bestätigungsnachricht von der Kernnetzwerkvorrichtung, wobei die Bestätigungsnachricht anzeigt, dass die Kernnetzwerkvorrichtung eine Freigabe eines NAS-Kontexts des Endgeräts abgeschlossen hat.

source: 9. A communication method, applied to a core network device, wherein the method comprises:
de_de: 9. Kommunikationsverfahren, das auf eine Kernnetzwerkvorrichtung angewendet wird, wobei das Verfahren Folgendes umfasst:

source: receiving a first request message from a first access network device, wherein the first request message is used to request the core network device to release a non-access stratum, NAS, context of a terminal device, and the first request message comprises small data transmission, SDT, failure information; and
de_de: Empfangen einer ersten Anforderungsnachricht von einer ersten Zugriffsnetzwerkvorrichtung, wobei die erste Anforderungsnachricht verwendet wird, um die Kernnetzwerkvorrichtung aufzufordern, einen Non-Access-Stratum-(NAS-)Kontext eines Endgeräts freizugeben, und die erste Anforderungsnachricht Fehlerinformationen über eine Übertragung kleiner Datenmengen (SDT) umfasst; und

source: releasing the NAS context of the terminal device based on the SDT failure information.
de_de: Freigeben des NAS-Kontexts des Endgeräts basierend auf den SDT-Fehlerinformationen.

source: The method according to claim 9, wherein the method further comprises:
de_de: Verfahren nach Anspruch 9, wobei das Verfahren ferner Folgendes umfasst:

source: sending an acknowledgment message to the first access network device, wherein the acknowledgment message indicates that the core network device has completed release of the NAS context of the terminal device.
de_de: Senden einer Bestätigungsnachricht an die erste Zugriffsnetzwerkvorrichtung, wobei die Bestätigungsnachricht anzeigt, dass die Kernnetzwerkvorrichtung eine Freigabe des NAS-Kontexts des Endgeräts abgeschlossen hat.

source: A communication apparatus, wherein the apparatus comprising a processor, wherein the processor is coupled to a memory; and
de_de: Kommunikationsvorrichtung, wobei die Vorrichtung einen Prozessor umfasst, wobei der Prozessor mit einem Speicher gekoppelt ist; und

source: the processor is configured to execute a computer program stored in the memory, to enable the communication apparatus to perform the communication method according to any one of claims 1 to 8.
de_de: der Prozessor konfiguriert ist, um ein in dem Speicher gespeichertes Computerprogramm auszuführen, um der Kommunikationsvorrichtung zu ermöglichen, das Kommunikationsverfahren gemäß einem der Ansprüche 1 bis 8 durchzuführen.

source: the processor is configured to execute a computer program stored in the memory, to enable the communication apparatus to perform the communication method according to claim 9 or 10.
de_de: der Prozessor konfiguriert ist, um ein in dem Speicher gespeichertes Computerprogramm auszuführen, um der Kommunikationsvorrichtung zu ermöglichen, das Kommunikationsverfahren nach Anspruch 9 oder 10 durchzuführen.

source: 1. A method for power control, comprising:
de_de: 1. Verfahren zur Leistungsregelung, umfassend:

source: sending (S700), by a second node, a reference signal to a first node, wherein the first nodes and the second node are integrated access and backhaul nodes;
de_de: Senden (S700) eines Referenzsignals durch einen zweiten Knoten an einen ersten Knoten, wobei die ersten Knoten und der zweite Knoten integrierte Zugriffs- und Backhaul-Knoten sind;

source: determining (S702), by the first node, a transmit power dynamic range of the second node based on the reference signal;; and;
de_de: Bestimmen (S702) eines Übertragungsleistungs-Dynamikbereichs des zweiten Knotens durch den ersten Knoten auf der Grundlage des Referenzsignals; und

source: sending, (S704) by the first node, the transmit power dynamic range of the second node to the second node; and;
de_de: Senden (S704) des Übertragungsleistungs-Dynamikbereichs des zweiten Knotens durch den ersten Knoten an den zweiten Knoten; und

source: determining (S706), by the second node, a transmit power according to the transmit power dynamic range; wherein: the second node is an upstream node of the first node.
de_de: Bestimmen (S706) einer Übertragungsleistung gemäß dem Übertragungsleistungs-Dynamikbereich durch den zweiten Knoten; wobei: der zweite Knoten ein Upstream-Knoten des ersten Knotens ist.

source: 2. The method according to claim 1, wherein the transmit power dynamic range of the second node is carried in a Media Access Control control element, MAC CE.
de_de: 2. Verfahren nach Anspruch 1, wobei der Übertragungsleistungs-Dynamikbereich des zweiten Knotens in einem Medienzugriffsregelungssteuerelement, MAC CE, übermittelt wird.

source: 3. The method according to claim 1 or 2, further comprising:
de_de: 3. Verfahren nach Anspruch 1 oder 2, ferner umfassend:

source: sending (S708), by the second node, a signal to the first node based on the determined transmit power.
de_de: Senden (S708) eines Signals durch den zweiten Knoten an den ersten Knoten auf der Grundlage der bestimmten Übertragungsleistung.

source: 4. The method according to any one of claims 1-3, wherein the transmit power dynamic range of the second node is a transmit power adjustment value of the second node.
de_de: 4. Verfahren nach einem der Ansprüche 1-3, wobei der Übertragungsleistungs-Dynamikbereich des zweiten Knotens ein Übertragungsleistungs-Anpassungswert des zweiten Knotens ist.

source: 5. An apparatus (800), comprising:
de_de: 5. Vorrichtung (800), umfassend:

source: a transceiver unit (802), configured to send a reference signal to a first node, wherein the reference signal is used to determine a transmit power dynamic range of the apparatus (800); and;
de_de: eine Sender-Empfänger-Einheit (802), konfiguriert, um ein Referenzsignal an einen ersten Knoten zu senden, wobei das Referenzsignal verwendet wird, um einen Übertragungsleistungs-Dynamikbereich der Vorrichtung (800) zu bestimmen; und

source: the transceiver unit (802) is further configured to receive a transmit power dynamic range of the apparatus (800) from the first node, wherein the apparatus is an upstream node of the first node and the first node and the apparatus are integrated access and backhaul nodes; and;
de_de: die Sender-Empfänger-Einheit (802) ferner konfiguriert ist, um einen Übertragungsleistungs-Dynamikbereich der Vorrichtung (800) von dem ersten Knoten zu empfangen, wobei die Vorrichtung ein Upstream-Knoten des ersten Knotens ist und der erste Knoten und die Vorrichtung integrierte Zugriffs- und Backhaul-Knoten sind; und

source: a processing unit (804), configured to determine a transmit power based on the transmit power dynamic range; wherein: the apparatus (800) is an upper-level node of the first node.
de_de: eine Verarbeitungseinheit (804), konfiguriert, um eine Übertragungsleistung auf der Grundlage des Übertragungsleistungs-Dynamikbereichs zu bestimmen; wobei: die Vorrichtung (800) ein übergeordneter Knoten des ersten Knotens ist.

source: 6. The apparatus (800) according to claim 5, wherein the transmit power dynamic range of the apparatus (800) is carried in a Media Access Control control element, MAC CE.
de_de: 6. Vorrichtung (800) nach Anspruch 5, wobei der Übertragungsleistungs-Dynamikbereich der Vorrichtung (800) in einem Medienzugriffsregelungssteuerelement, MAC CE, übermittelt wird.

source: 7. The apparatus (800) according to claim 5 or 6, wherein:
de_de: 7. Vorrichtung (800) nach Anspruch 5 oder 6, wobei:

source: the transceiver unit (802) is further configured to send a signal to the first node based on the determined transmit power.
de_de: die Sender-Empfänger-Einheit (802) ferner konfiguriert ist, um ein Signal an den ersten Knoten auf der Grundlage der bestimmten Übertragungsleistung zu senden.

source: 8. The apparatus (800) according to any one of claims 5-7, wherein the transmit power dynamic range of the apparatus (800) is a transmit power adjustment value of the apparatus (800).
de_de: 8. Vorrichtung (800) nach einem der Ansprüche 5-7, wobei der Übertragungsleistungs-Dynamikbereich der Vorrichtung (800) ein Übertragungsleistungs-Anpassungswert der Vorrichtung (800) ist.

source: 9. An apparatus (900), comprising:
de_de: 9. Vorrichtung (900), umfassend:

source: a processing unit (904), configured to determine a transmit power dynamic range of a second node based on a reference signal sent by the second node; and;
de_de: eine Verarbeitungseinheit (904), konfiguriert, um einen Übertragungsleistungs-Dynamikbereich eines zweiten Knotens auf der Grundlage eines von dem zweiten Knoten gesendeten Referenzsignals zu bestimmen; und

source: a transceiver unit (902), configured to send the transmit power dynamic range of the second node to the second node, wherein the second node is an upstream node of the apparatus (900) and the second node and the apparatus (900) are integrated access and backhaul nodes.
de_de: eine Sender-Empfänger-Einheit (902), konfiguriert, um den Übertragungsleistungs-Dynamikbereich des zweiten Knotens an den zweiten Knoten zu senden, wobei der zweite Knoten ein Upstream-Knoten der Vorrichtung (900) ist und der zweite Knoten und die Vorrichtung (900) integrierte Zugriffs- und Backhaul-Knoten sind.

source: The apparatus (900) according to claim 9, wherein the transmit power dynamic range of the second node is carried in a Media Access Control control element, MAC CE.
de_de: Vorrichtung (900) nach Anspruch 9, wobei der Übertragungsleistungs-Dynamikbereich des zweiten Knotens in einem Medienzugriffsregelungssteuerelement, MAC CE, übermittelt wird.

source: The apparatus (900) according to claim 9 or 10, wherein the transmit power dynamic range of the second node is a transmit power adjustment value of the second node.
de_de: Vorrichtung (900) nach Anspruch 9 oder 10, wobei der Übertragungsleistungs-Dynamikbereich des zweiten Knotens ein Übertragungsleistungs-Anpassungswert des zweiten Knotens ist.

source: A computer readable storage medium storing a computer program, that when executed by a first node, wherein the first node is an integrated access and backhaul node, causes the steps performed by the first node in the method according to any one of claims 1 to 4 to be implemented.
de_de: Computerlesbares Speichermedium, das ein Computerprogramm speichert, das, wenn es von einem ersten Knoten ausgeführt wird, wobei der erste Knoten ein integrierter Zugriffs- und Backhaul-Knoten ist, bewirkt, dass die von dem ersten Knoten in dem Verfahren nach einem der Ansprüche 1 bis 4 durchgeführten Schritte implementiert werden.

source: A program product comprising a computer program, that when executed by a first node, wherein the first node is an integrated access and backhaul node, causes the steps performed by the first node in the method according to any one of claims 1 to 4 to be implemented.
de_de: Programmprodukt, umfassend ein Computerprogramm, das, wenn es von einem ersten Knoten ausgeführt wird, wobei der erste Knoten ein integrierter Zugriffs- und Backhaul-Knoten ist, bewirkt, dass die von dem ersten Knoten in dem Verfahren nach einem der Ansprüche 1 bis 4 durchgeführten Schritte implementiert werden.

source: A computer readable storage medium storing a computer program, that when executed by a second node, wherein the second node is an integrated access and backhaul node, causes the steps performed by the second node in the method according to any one of claims 1 to 4 to be implemented.
de_de: Computerlesbares Speichermedium, das ein Computerprogramm speichert, das, wenn es von einem zweiten Knoten ausgeführt wird, wobei der zweite Knoten ein integrierter Zugriffs- und Backhaul-Knoten ist, bewirkt, dass die von dem zweiten Knoten in dem Verfahren nach einem der Ansprüche 1 bis 4 durchgeführten Schritte implementiert werden.

source: A program product comprising a computer program, that when executed by a second node, wherein the second node is an integrated access and backhaul node, causes the steps performed by the second node in the method according to any one of claims 1 to 4 to be implemented.
de_de: Programmprodukt, umfassend ein Computerprogramm, das, wenn es von einem zweiten Knoten ausgeführt wird, wobei der zweite Knoten ein integrierter Zugriffs- und Backhaul-Knoten ist, bewirkt, dass die von dem zweiten Knoten in dem Verfahren nach einem der Ansprüche 1 bis 4 durchgeführten Schritte implementiert werden.

source: 1. A preamble transmission method, comprising:
de_de: 1. Präambelübertragungsverfahren, umfassend:

source: obtaining (S801), by a first communication apparatus (120), first information, wherein the first information comprises at least one of the following: historical timing advance TA information, geographical location information, or power information of the first communication apparatus (120);
de_de: Erlangen (S801) erster Informationen durch eine erste Kommunikationsvorrichtung (120), wobei die ersten Informationen mindestens eines der Folgenden umfassen: historische Timing-Advance-(TA-)Informationen, geografische Standortinformationen oder Leistungsinformationen der ersten Kommunikationsvorrichtung (120);

source: determining (S802), by the first communication apparatus (120), one group of preambles from KG groups of preambles based on the first information, wherein KG is an integer greater than 1, a total quantity of preambles in the KG groups of preambles is positively correlated with a quantity of preamble cyclic shifts, and the quantity of preamble cyclic shifts is positively correlated with the quantity KG of groups of preambles, wherein the determining, by the first communication apparatus (120), one group of preambles from KG groups of preambles based on the first information comprises:
de_de: Bestimmen (S802) einer Gruppe von Präambeln aus KG Gruppen von Präambeln durch die erste Kommunikationsvorrichtung (120) basierend auf den ersten Informationen, wobei KG eine Ganzzahl größer als 1 ist, eine Gesamtmenge von Präambeln in den KG Gruppen von Präambeln positiv mit einer Menge von zyklischen Präambelverschiebungen korreliert ist und die Menge von zyklischen Präambelverschiebungen positiv mit der Menge KG von Gruppen von Präambeln korreliert ist, wobei das Bestimmen einer Gruppe von Präambeln aus KG Gruppen von Präambeln basierend auf den ersten Informationen durch die erste Kommunikationsvorrichtung (120) Folgendes umfasst:

source: determining, by the first communication apparatus (120), a first parameter based on the first information, and determining the one group of preambles from the KG groups of preambles based on a correspondence between the first parameter and the KG groups of preambles,
de_de: Bestimmen eines ersten Parameters durch die erste Kommunikationsvorrichtung (120) basierend auf den ersten Informationen und Bestimmen der einen Gruppe von Präambeln aus den KG Gruppen von Präambeln basierend auf einer Entsprechung zwischen dem ersten Parameter und den KG Gruppen von Präambeln,

source: wherein an ith group of preambles in the KG groups of preambles is first arranged in ascending order of cyclic shift indexes, and then arranged in ascending order of root indexes, and an (i+1)th group of preambles in the KG groups of preambles is arranged sequentially after the ith group of preambles is arranged;
de_de: wobei eine i-te Gruppe von Präambeln in den KG Gruppen von Präambeln zuerst in aufsteigender Reihenfolge der zyklischen Verschiebungsindizes und dann in aufsteigender Reihenfolge der Stammindizes angeordnet wird, und eine (i+1)-te Gruppe von Präambeln in den KG Gruppen von Präambeln sequenziell angeordnet wird, nachdem die i-te Gruppe von Präambeln angeordnet ist;

source: in a value range of cyclic shift indexes, the ith group of preambles in the KG groups of preambles is first arranged in ascending order of the cyclic shift indexes, and then arranged in ascending order of root indexes; or
de_de: in einem Wertebereich von zyklischen Verschiebungsindizes die i-te Gruppe von Präambeln in den KG- Gruppen von Präambeln zuerst in aufsteigender Reihenfolge der zyklischen Verschiebungsindizes und dann in aufsteigender Reihenfolge der Stammindizes angeordnet wird; oder

source: the ith group of preambles in the KG groups of preambles is first arranged in ascending order of cyclic shift indexes, wherein the cyclic shift indexes are incremented by an interval of KG, and then is arranged in ascending order of root indexes, and the ith group of preambles in the KG groups of preambles is the same as the jth group of preambles; and
de_de: die i-te Gruppe von Präambeln in den KG Gruppen von Präambeln zunächst in aufsteigender Reihenfolge der zyklischen Verschiebungsindizes angeordnet wird, wobei die zyklischen Verschiebungsindizes um ein Intervall von KG erhöht werden, und dann in aufsteigender Reihenfolge der Stammindizes angeordnet wird, und die i-te Gruppe von Präambeln in den KG Gruppen von Präambeln dieselbe wie die j-te Gruppe von Präambeln ist; und

source: sending (S803), by the first communication apparatus (120), a first preamble in the one group of preambles to a network device (502).
de_de: Senden (S803) einer ersten Präambel in der einen Gruppe von Präambeln durch die erste Kommunikationsvorrichtung (120) an eine Netzwerkvorrichtung (502).
